#include "header.h"

const char *ch_piece[16] =
{ "a--", "と", "c--", "d--", "銀", "金", "歩", "h--",
  "王", "香", "C--", "D--", "角", "桂", "飛", "H--" };

const char *ch_piece2[32] =
{ " --", "^と", " --", " --", "^銀", "^金", "^歩", "--",
  "^王", "^香", " --", " --", "^角", "^桂", "^飛", "--",
  " --", "vと", " --", " --", "v銀", "v金", "v歩", "--",
  "v王", "v香", " --", " --", "v角", "v桂", "v飛", "--" };

const char *ch_piece_csa[16] =
{ "--", "TO", "--", "--", "GI", "KI", "FU", "--",
  "OU", "KY", "--", "--", "KA", "KE", "HI", "--" };


